Австралия/src/Documents/AccountSalesToConsignor/AccountSalesToConsignor.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AccountSalesToConsignor</name>
  <basedOn>Catalog.Counterparties</basedOn>
  <basedOn>Document.GoodsReceipt</basedOn>
  <registerRecords>AccumulationRegister.Sales</registerRecords>
  <registerRecords>InformationRegister.AccountingEntriesData</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesSimple</registerRecords>
  <registerRecords>AccumulationRegister.PaymentCalendar</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpensesCashMethod</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntries</registerRecords>
  <registerRecords>AccumulationRegister.StockReceivedFromThirdParties</registerRecords>
  <registerRecords>InformationRegister.DocumentAccountingEntriesStatuses</registerRecords>
  <registerRecords>InformationRegister.SerialNumbersInWarranty</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpenses</registerRecords>
  <registerRecords>AccumulationRegister.AccountsPayable</registerRecords>
  <registerRecords>AccumulationRegister.IncomeAndExpensesRetained</registerRecords>
  <registerRecords>AccumulationRegister.UnallocatedExpenses</registerRecords>
  <registerRecords>AccountingRegister.AccountingJournalEntriesCompound</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>SupplierPriceTypes</name>
    <type>
      <types>CatalogRef.SupplierPriceTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>VATTaxation</name>
    <type>
      <types>EnumRef.VATTaxationTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>AmountIncludesVAT</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IncludeVATInPrice</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ExchangeRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Multiplicity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>BrokerageCalculationMethod</name>
    <type>
      <types>EnumRef.CommissionFeeCalculationMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>CommissionFeePercent</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VATCommissionFeePercent</name>
    <type>
      <types>CatalogRef.VATRates</types>
    </type>
  </attributes>
  <attributes>
    <name>KeepBackCommissionFee</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentMethod</name>
    <type>
      <types>CatalogRef.PaymentMethods</types>
    </type>
  </attributes>
  <attributes>
    <name>BankAccount</name>
    <type>
      <types>CatalogRef.BankAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>PettyCash</name>
    <type>
      <types>CatalogRef.CashAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>SetPaymentTerms</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AccountsPayableGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>AdvancesPaidGLAccount</name>
    <type>
      <types>ChartOfAccountsRef.PrimaryChartOfAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractCurrencyExchangeRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ContractCurrencyMultiplicity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CashAssetType</name>
    <type>
      <types>EnumRef.CashAssetTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>AutomaticVATCalculation</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyVATNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ForOpeningBalancesOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentTax</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Inventory</name>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>Batch</name>
      <type>
        <types>CatalogRef.ProductsBatches</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Precision</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>CatalogRef.VATRates</types>
      </type>
    </attributes>
    <attributes>
      <name>VATAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SalesOrder</name>
      <type>
        <types>DocumentRef.SalesOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>ReceiptPrice</name>
      <type>
        <types>DefinedType.Precision</types>
      </type>
    </attributes>
    <attributes>
      <name>AmountReceipt</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ReceiptVATAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PurchaseOrder</name>
      <type>
        <types>DocumentRef.PurchaseOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>BrokerageAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>BrokerageVATAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Customer</name>
      <type>
        <types>CatalogRef.Counterparties</types>
      </type>
    </attributes>
    <attributes>
      <name>DateOfSale</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SerialNumbers</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ConnectionKey</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>SalesRep</name>
      <type>
        <types>CatalogRef.Employees</types>
      </type>
    </attributes>
    <attributes>
      <name>Ownership</name>
      <type>
        <types>CatalogRef.InventoryOwnership</types>
      </type>
    </attributes>
    <attributes>
      <name>Project</name>
      <type>
        <types>CatalogRef.Projects</types>
      </type>
    </attributes>
    <attributes>
      <name>RevenueItem</name>
      <type>
        <types>CatalogRef.IncomeAndExpenseItems</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>PaymentCalendar</name>
    <attributes>
      <name>PaymentDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentPercentage</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentVATAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentBaselineDate</name>
      <type>
        <types>EnumRef.BaselineDateForPayment</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Prepayment</name>
    <attributes>
      <name>Document</name>
      <type>
        <types>DocumentRef.PaymentExpense</types>
        <types>DocumentRef.ExpenseReport</types>
        <types>DocumentRef.CashVoucher</types>
        <types>DocumentRef.ArApAdjustments</types>
      </type>
    </attributes>
    <attributes>
      <name>Order</name>
      <type>
        <types>DocumentRef.PurchaseOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>SettlementsAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ExchangeRate</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Multiplicity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaymentAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AmountDocCur</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SerialNumbers</name>
    <attributes>
      <name>SerialNumber</name>
      <type>
        <types>CatalogRef.SerialNumbers</types>
      </type>
    </attributes>
    <attributes>
      <name>ConnectionKey</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/Documents/AccountSalesToConsignor/Forms/ListForm/Module.bsl
//////////////////////////////////////////////////////////////////////////////// 
// EVENT HANDLERS

&AtServer
// Procedure - OnCreateAtServer event handler.
//
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	// StandardSubsystems.AdditionalReportsAndDataProcessors
	AdditionalReportsAndDataProcessors.OnCreateAtServer(ThisObject);
	// End StandardSubsystems.AdditionalReportsAndDataProcessors
	
	// StandardSubsystems.AttachableCommands
	AttachableCommands.OnCreateAtServer(ThisObject);
	// End StandardSubsystems.AttachableCommands
	
EndProcedure

&AtServer
// Procedure - form event handler "OnLoadDataFromSettingsAtServer".
//
Procedure OnLoadDataFromSettingsAtServer(Settings)
	
	Company		= Settings.Get("Company");
	Counterparty		= Settings.Get("Counterparty");
	Department	= Settings.Get("Department");
	
	DriveClientServer.SetListFilterItem(List, "Company", Company, ValueIsFilled(Company));
	DriveClientServer.SetListFilterItem(List, "Counterparty", Counterparty, ValueIsFilled(Counterparty));
	DriveClientServer.SetListFilterItem(List, "Department", Department, ValueIsFilled(Department));
	
EndProcedure

&AtClient
// Procedure - event handler OnChange of attribute Department.
// 
Procedure DepartmentOnChange(Item)
	
	DriveClientServer.SetListFilterItem(List, "Department", Department, ValueIsFilled(Department));
	
EndProcedure

&AtClient
// Procedure - event handler OnChange of attribute Counterparty.
// 
Procedure CounterpartyOnChange(Item)
	
	DriveClientServer.SetListFilterItem(List, "Counterparty", Counterparty, ValueIsFilled(Counterparty));
	
EndProcedure

&AtClient
// Procedure - event handler OnChange of the Company attribute.
// 
Procedure CompanyOnChange(Item)
	
	DriveClientServer.SetListFilterItem(List, "Company", Company, ValueIsFilled(Company));
	
EndProcedure

&AtClient
Procedure ListOnActivateRow(Item)
	
	// StandardSubsystems.AttachableCommands
	AttachableCommandsClient.StartCommandUpdate(ThisObject);
	// End StandardSubsystems.AttachableCommands
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	
	// StandardSubsystems.AttachableCommands
	AttachableCommandsClient.StartCommandUpdate(ThisObject);
	// End StandardSubsystems.AttachableCommands
	
EndProcedure

#Region LibrariesHandlers

// StandardSubsystems.AttachableCommands
&AtClient
Procedure Attachable_ExecuteCommand(Command)
	AttachableCommandsClient.ExecuteCommand(ThisObject, Command, Items.List);
EndProcedure

&AtServer
Procedure Attachable_ExecuteCommandAtServer(Context, Result)
	AttachableCommands.ExecuteCommand(ThisObject, Context, Items.List, Result);
EndProcedure

&AtClient
Procedure Attachable_UpdateCommands()
	AttachableCommandsClientServer.UpdateCommands(ThisObject, Items.List);
EndProcedure
// End StandardSubsystems.AttachableCommands

#EndRegion
